# Erase Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
GeomCombinationSet..::..Erase Method
GeomCombinationSet Class See Also
---
Removes a specified GeomCombination from the set.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public virtual int Erase(
	GeomCombination item
)
```

Visual Basic
---
```text
Public Overridable Function Erase ( _
	item As GeomCombination _
) As Integer
```

Visual C++
---
```text
public:
virtual int Erase(
	GeomCombination^ item
)
```

# ### Parameters
item
    Type: Autodesk.Revit.DB..::..GeomCombinationThe GeomCombination to be erased.
# ### Return Value
The number of GeomCombinations that were erased from the set.
# See Also
GeomCombinationSet Class
Autodesk.Revit.DB Namespace